# Gebruik van SQL in een notebook

Gebruik dit notebook met het bestand `autos.sql` (via de URL `module`-parameter), met de volgende inhoud:

```
CREATE TABLE autos( id integer, model text, merk text);
INSERT INTO autos VALUES (1,'Kangoo','Renault');
INSERT INTO autos VALUES (3,'Alpine','Renault');
INSERT INTO autos VALUES (4,'Golf','Volkswagen');
INSERT INTO autos VALUES (2,'Mégane','Renault');
INSERT INTO autos VALUES (5,'Fiesta','Ford');
INSERT INTO autos VALUES (6,'Polo','Volkswagen');
```

Je kunt daarna direct de volgende *query* uitvoeren io de tabel `autos`:

In [ ]:
SELECT * FROM autos;

Met SQL-opdrachten in een code-cel kun je een tweede tabel aanmaken:

In [ ]:
CREATE TABLE fabrikanten( merk text,
                          land   text);

INSERT INTO fabrikanten VALUES ('Renault', 'Frankrijk');
INSERT INTO fabrikanten VALUES ('Fiat','Italie');
INSERT INTO fabrikanten VALUES ('Volkswagen','Duitsland');
INSERT INTO fabrikanten VALUES ('Ford','USA');
INSERT INTO fabrikanten VALUES ('Ferrari','Italië');

De queries werken ook op deze tabel:

In [ ]:
SELECT * FROM fabrikanten
WHERE land like "Italië";

In [ ]:
SELECT model, a.merk, land FROM autos as a
JOIN fabrikanten as f on f.merk=a.merk;

Je kunt de bestaande tabellen ook bijwerken:

In [ ]:
UPDATE fabrikanten set land="Verenigde Staten" where land = "USA";

In [ ]:
SELECT model, a.merk, land 
FROM autos as a
JOIN fabrikanten as f ON f.merk = a.merk;